#+title: STT It
#+startup: content

* Help
#+begin_src sh :results pp
sttit -h
#+end_src

#+begin_example
sttit - Speak To Text Videos and Files

Using OpenAI-compatible API, generate Whisper-powered JSON transcript from audio from files or contained in a video.
Supported formats: All ffmpeg-supported formats.

Change the OpenAI Compatible API host and key with the following envs:
- STTIT_OPENAI_WHISPER_API_HOST
- STTIT_OPENAI_WHISPER_API_KEY (optional)
- STTIT_OPENAI_WHISPER_API_MODEL (optional)

Usage:
  sttit [options] filename

Arguments:
  --help, -h: Show help
  --verbose, -v: Enable verbose mode
  --disable-vad-filter, -d: Disable Voice Activity Detection filter (enabled by default)
  --timestamp-granulatity, -t: Timestamp granularity (default: word)
  --response-format, -r: Response format (default: json)
  --output, -o: Output file
  filename: File to process

Examples:
  sttit ./audio.mp3
  sttit ./video.mp4 -v -t segment
#+end_example


* Examples
** Convert audio from URL
#+begin_src bash :results pp
export STTIT_OPENAI_WHISPER_API_HOST="http://192.168.15.179:8000"
export STTIT_OPENAI_WHISPER_API_MODEL="Systran/faster-whisper-tiny"

sttit https://github.com/speaches-ai/speaches/raw/31537d182e79f198a6083d01495da7670d0b3e27/audio.wav
#+end_src

: {"text":"Hello, world."}

*** Verbose mode
#+begin_src bash :results pp
export STTIT_OPENAI_WHISPER_API_HOST="http://192.168.15.179:8000"
export STTIT_OPENAI_WHISPER_API_MODEL="Systran/faster-whisper-tiny"

sttit -v https://github.com/speaches-ai/speaches/raw/31537d182e79f198a6083d01495da7670d0b3e27/audio.wav -o transcribed.json

echo -e "\nFile Contents:"
cat transcribed.json | jq

rm transcribed.json
#+end_src

#+RESULTS:
#+begin_example
[2025-03-04 18:06:07:325] Setup: Voice Activity Detection filter is enabled by default. Use --disable-vad-filter to disable.
[2025-03-04 18:06:07:327] Setup: Timestamp granularity is set to word by default. Use --timestamp-granulatity to change.
[2025-03-04 18:06:07:330] Setup: Response format is set to verbose_json by default. Use --response-format to change.
[2025-03-04 18:06:07:332] Processing input: https://github.com/speaches-ai/speaches/raw/31537d182e79f198a6083d01495da7670d0b3e27/audio.wav
[2025-03-04 18:06:07:335] Output file: transcribed.json
[2025-03-04 18:06:07:337] OpenAI Whisper API Host: http://192.168.15.179:8000
[2025-03-04 18:06:07:339] OpenAI Whisper API Model: Systran/faster-whisper-tiny
[2025-03-04 18:06:07:342] OpenAI Whisper Preferences: vad_filter=true timestamp_granularities[]=word response_format=json
[2025-03-04 18:06:07:346] Downloading file: https://github.com/speaches-ai/speaches/raw/31537d182e79f198a6083d01495da7670d0b3e27/audio.wav
[2025-03-04 18:06:07:653] Downloaded file: https://github.com/speaches-ai/speaches/raw/31537d182e79f198a6083d01495da7670d0b3e27/audio.wav to /tmp/tmp.NsO29l685c
[2025-03-04 18:06:07:665] Sending audio to OpenAI Whisper API
[2025-03-04 18:06:07:668] Calling: curl -s http://192.168.15.179:8000/v1/audio/transcriptions -F file=@/tmp/tmp.NsO29l685c -F model=Systran/faster-whisper-tiny -F vad_filter=true -F timestamp_granularities[]=word -F response_format=json
[2025-03-04 18:06:08:266] API Call took: 594ms
[2025-03-04 18:06:08:269] Output written to: transcribed.json
[2025-03-04 18:06:08:270] Cleaning up temp files
[2025-03-04 18:06:08:273] Deleting temp file: /tmp/tmp.NsO29l685c
[2025-03-04 18:06:08:277] File does not exist: /tmp/tmp.NsO29l685c

File Contents:
{
  "text": "Hello, world."
}
#+end_example

** Convert video from URL (verbose)
#+begin_src bash :results pp
export STTIT_OPENAI_WHISPER_API_HOST="http://192.168.15.179:8000"
export STTIT_OPENAI_WHISPER_API_MODEL="Systran/faster-whisper-base"

sttit https://user-images.githubusercontent.com/1991296/204038393-2f846eae-c255-4099-a76d-5735c25c49da.mp4 -v
# Video credits: ggerganov/whisper.cpp readme
#+end_src

#+RESULTS:
#+begin_example
[2025-03-04 18:16:48:379] Setup: Voice Activity Detection filter is enabled by default. Use --disable-vad-filter to disable.
[2025-03-04 18:16:48:382] Setup: Timestamp granularity is set to word by default. Use --timestamp-granulatity to change.
[2025-03-04 18:16:48:386] Setup: Response format is set to verbose_json by default. Use --response-format to change.
[2025-03-04 18:16:48:389] Processing input: https://user-images.githubusercontent.com/1991296/204038393-2f846eae-c255-4099-a76d-5735c25c49da.mp4
[2025-03-04 18:16:48:391] Output file: stdout
[2025-03-04 18:16:48:393] OpenAI Whisper API Host: http://192.168.15.179:8000
[2025-03-04 18:16:48:395] OpenAI Whisper API Model: Systran/faster-whisper-base
[2025-03-04 18:16:48:397] OpenAI Whisper Preferences: vad_filter=true timestamp_granularities[]=word response_format=json
[2025-03-04 18:16:48:400] Downloading file: https://user-images.githubusercontent.com/1991296/204038393-2f846eae-c255-4099-a76d-5735c25c49da.mp4
[2025-03-04 18:16:48:599] Downloaded file: https://user-images.githubusercontent.com/1991296/204038393-2f846eae-c255-4099-a76d-5735c25c49da.mp4 to /tmp/tmp.iTkZlv7yBu
[2025-03-04 18:16:48:623] Extracting audio from video: /tmp/tmp.iTkZlv7yBu
[2025-03-04 18:16:49:170] Extracted audio from video: /tmp/tmp.iTkZlv7yBu to /tmp/tmp.0K0VBbNDfJ.wav
[2025-03-04 18:16:49:172] Sending audio to OpenAI Whisper API
[2025-03-04 18:16:49:174] Calling: curl -s http://192.168.15.179:8000/v1/audio/transcriptions -F file=@/tmp/tmp.0K0VBbNDfJ.wav -F model=Systran/faster-whisper-base -F vad_filter=true -F timestamp_granularities[]=word -F response_format=json
[2025-03-04 18:16:52:887] API Call took: 3709ms
{"text":"Ok Whisper, start listening for commands. Play some music. Send a message. Turn on the lights. Turn off the lights. Call the restaurant and make a reservation. Kill all the humans. What time is it? Okay, call Jonathan on the phone. Remind me to do something important tomorrow. Good bye."}
[2025-03-04 18:16:52:889] Cleaning up temp files
[2025-03-04 18:16:52:892] Deleting temp file: /tmp/tmp.iTkZlv7yBu
[2025-03-04 18:16:52:897] Deleting temp file: /tmp/tmp.0K0VBbNDfJ.wav
#+end_example
